emacs/README.org
#+TITLE: Emacs Configuration
#+AUTHOR: t3mpt0n
#+OPTIONS: toc:2

* Introduction
This is the configutation to my Emacs, enjoy!

Use this to set your config directory:
#+begin_src elisp :tangle ./init.el
  (setq-default user-emacs-directory "/etc/nixos/modules/emacs")
  (let ((default-directory (expand-file-name "modules" user-emacs-directory)))
    (normal-top-level-add-subdirs-to-load-path))
#+end_src

* Package Managers
** [[https://github.com/progfolio/elpaca][Elpaca]]
The package manager used for my configuration along with nix for the Emacs package itself

Requirements:
- Emacs >= 27.1
- Git

This will clone Elpaca to =user-emacs-directory/elpaca=
*** Installer
#+begin_src elisp :mkdirp yes :tangle ./modules/elpaca/installer.el
  (defvar elpaca-installer-version 0.5)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src
*** Configuration
#+begin_src elisp :mkdirp yes :tangle ./modules/elpaca/config.el
  (elpaca elpaca-use-package
     (elpaca-use-package)
     (setq elpaca-use-package-by-default t))
  (elpaca-wait)
#+end_src
Also, make sure that any =after-init-hook= or =emacs-startup-hook= is changed to =elpaca-after-init-hook=.

** [[https://github.com/NixOS/nix][Nix]]
Requirements:
- Nix Package Manager

My personal choice of package manager, however, *NOT* configured in elisp.
*** Setting up the emacs package itself
#+begin_src nix :tangle ./default.nix
  {
    self,
    pkgs,
    ...
  }: {
    imports = [
      ./lsp
    ];

    nixpkgs.overlays = [ (import self.inputs.emacs-overlay) ];

    environment.systemPackages = [
      (pkgs.emacsWithPackagesFromUsePackage {
        config = ./init.el;
        defaultInitFile = true;
        package = pkgs.emacsPgtk;
        extraEmacsPackages = epkgs: with epkgs; [
          use-package # Install use-package to use in tandem w/ elpaca
        ];
        alwaysEnsure = true;
      })
      (pkgs.nerdfonts.override { fonts = [ "FiraCode" "Iosevka" "NerdFontsSymbolsOnly" ]; })
      pkgs.fira-code-symbols
    ];

    services.emacs.enable = true;
  }
#+end_src

* User Interface
By default, Emacs looks like shit... let's fix that!
*** Some initial setup
#+begin_src elisp :tangle ./modules/UI.el
  (setq use-package-always-ensure t)

  (use-package emacs
    :init
    (setq inhibit-startup-message t
          visible-bell t
          frame-resize-pixelwise t
          package-native-compile t)
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (menu-bar-mode -1)
    (global-prettify-symbols-mode 1)
    (defvar t3mpt0n/font "FiraCode Nerd Font"
      "Font for Emacs.")
    :hook
    (prog-mode . menu-bar--display-line-numbers-mode-relative)
    (org-mode . menu-bar--display-line-numbers-mode-relative)
    (find-file . (lambda () (set-face-attribute 'default nil :font t3mpt0n/font :height 148)))
    )
#+end_src

*** Ligatures
Requirements:
- Fira Code ::
  - Fira Code Symbols
  - Emacs >= 28.1
- Non-Fira Code ::
  - Emacs >= 28.1

Like every zoomer, I like my ligatures :).
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (if (and (= (string-search "FiraCode" t3mpt0n/font) 1) (> emacs-major-version 28))
      (progn
        (use-package fira-code-mode
          :after emacs
          :hook prog-mode)

        (use-package ligature
          :after emacs
          (ligature-set-ligatures 't '("www"))))
    (use-package ligature
      :after emacs
      :config
      (ligature-set-ligatures 't '("www"))
      (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                           ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                           "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                           "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                           "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                           "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                           "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                           "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                           ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                           "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                           "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                           "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                           "\\\\" "://"))
      (global-ligature-mode t)))
#+end_src

*** Icons
Enable icons for later.
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (use-package all-the-icons)
  (use-package all-the-icons-nerd-fonts :after all-the-icons)
  (use-package nerd-icons)
  (use-package nerd-icons-completion :after nerd-icons)
  (use-package emojify
    :hook (elpaca-after-init . global-emojify-mode))
#+end_src

*** Theme
**** Modeline
I like the modeline from Spacemacs.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package spaceline
    :init
    (setq powerline-default-seperator nil
          spacemacs-theme-underline-parens t))

  (use-package spaceline-all-the-icons
    :after all-the-icons
    :after all-the-icons-nerd-fonts)
#+end_src

**** DOOM
Doom Emacs has a great collection of themes and colors my modeline.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package doom-themes
    :init
    (progn
      (load-theme 'doom-tomorrow-night t)
      (enable-theme 'doom-tomorrow-night)))

  (use-package doom-modeline
    :init (doom-modeline-mode 1))
#+end_src

*** Menus
Hodgepodge of menu stuff that's worked for me so far.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package counsel
    :bind (
     ("M-x" . counsel-M-x)
     ("C-x b" . counsel-ibuffer)
     ("C-x C-f" . counsel-find-file)))

  (use-package prescient
    :config (setq prescient-persist-mode t))

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)))

  (use-package ivy-prescient
    :after counsel
    :config
    (ivy-prescient-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  (use-package vertico
    :init
    (vertico-mode))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :demand t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

*** Sway fix && Transparency
Fix emacs bugginess on Sway (for the most part).
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (use-package shackle
    :demand t
    :config
    (setq frame-title-format '("%b — GNU Emacs [" (:eval (frame-parameter (selected-frame) 'window-id)) "]"))
    (add-to-list 'default-frame-alist '(alpha-background . 90)))

  (use-package sway
    :config
    (sway-socket-tracker-mode)
    (sway-undertaker-mode)
    (sway-x-focus-through-sway-mode))
#+end_src

* Startup
** Garbage Cleanup
Move backup files to one folder to save me writing an MLA format =.gitignore=.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (setq backup-directory-alist '(("" . (expand-file-name "backup" user-emacs-directory)))
        backup-by-copying t
        version-control t
        delete-old-backups t
        kept-new-versions 20
        kept-old-versions 5)
#+end_src

** Custom Functions
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (defun t3mpt0n/show-and-copy-buffer-path ()
    "Show and copy the full path to the current file in the minibuffer."
    (interactive)
    ;; list-buffers-directory is the variable set in dired buffers
    (let ((file-name (or (buffer-file-name) list-buffers-directory)))
      (if file-name
          (message (kill-new file-name))
        (error "Buffer not visiting a file"))))
#+end_src

** Dashboard
I don't want to open a frame just to see an empty scratch buffer.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package dashboard
    :init
    (dashboard-setup-startup-hook)

    :config
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
          dashboard-items '((bookmarks . 7)
                            (agenda . 3)
                            (recents . 5))
          dashboard-banner-ascii "NIXMACS"
          dashboard-center-content t
          dashboard-set-init-info t
          dashboard-filter-agenda-entry 'dashboard-no-filter-agenda))
#+end_src

** Enable Keybindings
Useful for configuring keybindings later.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package general
    :init
    (general-create-definer t3mpt0n/leader-keys
      :keymaps '(normal insert visual emacs)
      :states '(normal visual)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (winner-mode 1)

    :config
    (general-evil-setup t))

  (use-package which-key
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-idle-delay 0.2
          which-key-allow-imprecise-window-fit t)
    (which-key-mode)
    :diminish
    which-key-mode)

  (use-package hydra)
#+end_src

*** Some convinient keys
**** Use ESC and not C-g
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

**** Quits (SPC q)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "q" '(:which-key "Quits")
    "q q" '(save-buffers-kill-terminal :which-key "Save Buffers Kill Frame")
    "q 3" 'server-edit
    "q 5 0" '(delete-frame :which-key "Delete Frame")
    "q k" '(save-buffers-kill-emacs :which-key "Kill Daemon Gracefully"))
#+end_src

**** Buffers (SPC b)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "b" '(:which-key "Buffers")
    "b m" '(counsel-ibuffer :which-key "Switch to Another Buffer")
    "b c" '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
    "b b" '(ibuffer-list-buffers :which-key "List Buffers in Seperate Window")
    "b B" '(ibuffer :which-key "List Buffers in Same Window")
    "b d" '(kill-current-buffer :which-key "Kill Current Buffer")
    "b D" '(kill-buffer :which-key "Choose Which Buffer to Kill")
    "b l" '(next-buffer :which-key "Next Buffer")
    "b h" '(previous-buffer :which-key "Previous Buffer"))
#+end_src

**** Window Control w/ Evil & Winner (SPC w)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "w" '(:which-key "Windows")
    "w k" '(evil-window-delete :which-key "Close window")
    "w n" '(evil-window-new :which-key "New window")
    "w s" '(evil-window-split :which-key "Horizontal split window")
    "w v" '(evil-window-vsplit :which-key "Vertical split window")
    "w q" '(evil-quit :which-key "Quit Window")
    "w h" '(evil-window-left :which-key "Window left")
    "w j" '(evil-window-down :which-key "Window down")
    "w k" '(evil-window-up :which-key "Window up")
    "w l" '(evil-window-right :which-key "Window right")
    "w w" '(evil-window-next :which-key "Goto next window")
    "w >" '(evil-window-increase-width :which-key "Increase Width")
    "w <" '(evil-window-decrease-width :which-key "Decrease Width")
    "w +" '(evil-window-increase-height :which-key "Increase Height")
    "w -" '(evil-window-decrease-height :which-key "Decrease Height")
    "w <left>"  '(winner-undo :which-key "Winner undo")
    "w <right>" '(winner-redo :which-key "Winner redo"))
#+end_src

**** Files (SPC f)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "f"   '(:which-key "File")
    "f f" '(counsel-find-file :which-key "Find File")
    "f r" '(counsel-recentf :which-key "Recent Files")
    "f s" '(save-buffer :which-key "Save File")
    "f u" '(sudo-edit-find-file :which-key "Sudo Find File")
    "f y" '(t3mpt0n/show-and-copy-buffer-path :which-key "Yank File Path")
    "f C" '(copy-file :which-key "Copy file")
    "f D" '(delete-file :which-key "Delete file")
    "f R" '(rename-file :which-key "Rename file")
    "f S" '(write-file :which-key "Save File As...")
    "f U" '(sudo-edit :which-key "Sudo Edit File")
    "f b" '(byte-compile-file :which-key "Byte Compile File"))
#+end_src

**** Help (SPC h)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "h" '(:which-key "Help")
    "h v" '(describe-variable :which-key "Describe Variable")
    "h k" '(describe-key :which-key "Describe Key")
    "h f" '(describe-function :which-key "Describe Function"))
#+end_src

**** Misc. (SPC {varied})
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "SPC" '(counsel-M-x :which-key "M-x")
    "R 3" '((lambda () (interactive) (load-file "~/.emacs.d/init.el")) :which-key "Reload Emacs Config"))
#+end_src

