emacs/README.org
** Syntax Highlighting (Tree Sitter)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package tree-sitter
    :init (global-tree-sitter-mode)
    :config (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist)))
#+end_src

** Error Checking (Enabling Flycheck)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package flycheck
    :init
    (elpaca-after-init . global-flycheck-mode))

  (use-package flycheck-color-mode-line
    :after flycheck
    :hook (flycheck-mode . flycheck-color-mode-line-mode))
  (use-package flycheck-pos-tip :after flycheck)
#+end_src

** MaGit (Git Interface)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package magit
    :config
    (t3mpt0n/leader-keys
      "g" '(:which-key "Magit")
      "g S" '(magit-status :which-key "Magit Status")
      "g s" '(:which-key "Staging")
      "g s f" '(magit-stage-file :which-key "Stage Current File")
      "g b" '(:which-key "Branch")
      "g b c" '(magit-branch-create :which-key "Create")
      "g b d" '(magit-branch-delete :which-key "Delete")
      "g c" '(magit-commit :which-key "Commit")))
#+end_src

** Parantheses (Smartparens)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package smartparens
    :init
    (smartparens-global-mode 1)
    (show-smartparens-global-mode 1))

  (use-package elec-pair
    :after smartparens
    :hook
    (prog-mode . electric-pair-local-mode)
    (smartparens-mode . (lambda () electric-pair-local-mode -1)))

  (use-package parens
    :after smartparens
    :hook
    (prog-mode . show-paren-mode)
    (smartparens-mode . (lambda () show-paren-mode -1)))

  (use-package rainbow-delimiters ;; Colorful Parantheses
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Language Configurations (Eglot)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package eglot
    :hook
    (prog-mode . lunarix-mode)
    (prog-mode . disable-tabs)

    :config (setq debug-on-error t)
    :custom (defalias 'eglot--major-mode 'eglot--major-modes))
#+end_src

The code below just imports all the LSP files:
#+begin_src nix :mkdirp yes :tangle ./lsp/default.nix
  {
    ...
  }: {
    imports = [
      ./
    ];
  }
#+end_src

Below is a comprehensive configuration of all the languages I currently use:
*** Nix
**** [[https://github.com/oxalica/nil][NIL]]
Add this to your =flake.nix= [NOTE: this block is not tangled]:
#+begin_src nix
  inputs.nil = {
    url = "github:oxalica/nil";
    inputs.nixpkgs.follows = "nixpkgs";
  }
#+end_src

And then install it:
#+begin_src nix :mkdirp yes :tangle ./lsp/nil.nix
  {
    pkgs,
    lib,
    inputs,
    ...
  }: {
    nixpkgs.overlays = [ inputs.nil.overlays.default ];
    environment.systemPackages = [
      pkgs.nil
    ];
  }
#+end_src

**** Configuration
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package nix-mode
    :after eglot
    :hook
    (nix-mode . eglot-ensure)
    (nix-mode . tree-sitter-hl-mode)
    :config
    (push '(nix-mode . ("nil")) eglot-server-programs)
    (push 'company-nixos-options company-backends)
    (sp-with-modes 'nix-mode
      (sp-local-pair "\"" "\"")
      (sp-local-pair "{" "};" :unless '(sp-in-comment-p
                                        sp-in-string-quotes-p))
      (sp-local-pair "[" "];" :unless '(sp-in-comment-p
                                        sp-in-string-quotes-p))))
#+end_src

*** Emacs Lisp
Emacs is its own LSP so just push =company-elisp= to =company-backends=
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (push 'company-elisp company-backends)
#+end_src

**** Keybindings
***** Evalute eLisp (SPC e)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (t3mpt0n/leader-keys
    "e"   '(:which-key "Eval")
    "e b" '(eval-buffer :which-key "Eval Elisp in Buffer")
    "e d" '(eval-defun :which-key "Eval Defun")
    "e e" '(eval-expression :which-key "Eval Elisp Expression")
    "e l" '(eval-last-sexp :which-key "Eval Last Expression")
    "e r" '(eval-region :which-key "Eval Region"))
#+end_src

*** Shell
**** [[https://github.com/bash-lsp/bash-language-server][Bash Language Server]]
Install bash-language-server to Nix.
#+begin_src nix :mkdirp yes :tangle ./lsp/bls.nix
  {
    pgks,
    ...
  }: {
    environment.systemPackages = with pkgs; [
      nodePackages_latest.bash-language-server
    ];
  }
#+end_src

**** Configuration
The config's also pretty simple:
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package sh-script
    :after eglot
    :hook
    (sh-mode . eglot-ensure))
#+end_src

*** Python
**** Install [[https://github.com/davidhalter/jedi][Jedi]] && [[https://github.com/pylint-dev/pylint][Pylint]]
 will be our LSP and Pylint will be used for error checking.
#+begin_src nix :mkdirp yes :tangle ./lsp/jedi.nix
  {
    pkgs,
    ...
  }: {
    environment.systemPackages = with pkgs.python311Packages; = [
      jedi
      pylint
    ];
  }
#+end_src

**** Initial Setup
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package python-mode
    :after eglot
    :hook
    (python-mode . eglot-ensure)
    (python-mode . tree-sitter-hl-mode)

    :config
    (push '(python-mode . "jedi") eglot-server-programs)
    (push '(python "https://github.com/tree-sitter/tree-sitter-python") treesit-language-source-alist))
#+end_src

**** [[https://github.com/tkf/emacs-jedi][Jedi.el]]
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package jedi-core :after python-mode)

  (use-package company-jedi
    :after company
    :init
    (push 'company-jedi company-backends))
#+end_src

*** Ruby
**** Install [[https://github.com/castwide/solargraph][Solargraph]]
#+begin_src nix :mkdirp yes :tangle ./lsp/ruby.nix
  {
    pkgs,
    ...
  }: {
    environment.systemPackages = with pkgs; [
      (ruby.withPackages (ru: with ru; [
        solargraph
      ]))
      rubocop
    ];
  }
#+end_src

**** Configuration
Install robe for better ruby navigation.
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package robe)
  (use-package ruby-mode
    :after (eglot robe)
    :init
    (push '(ruby-mode . robe-mode) major-mode-remap-alist)

    :hook
    (robe-mode . eglot-ensure)
    (robe-mode . tree-sitter-hl-mode)

    :config
    (push 'company-robe company-backends)
    (push '(ruby "https://github.com/tree-sitter/tree-sitter-ruby") treesit-language-source-alist))
#+end_src

*** Crystal
Very similar to Ruby.
**** Install [[https://github.com/crystal-lang/crystal][Crystal]] & [[https://github.com/elbywan/crystalline][Crystalline]]
Crystalline is a currently in development LSP for Crystal.

***** First, we need to make a derivation...
For =src.sha256=, add =lib.fakeSha256= to it and then copy whatever the =got:= section of the error message spat out into it.
#+begin_src nix :mkdirp yes :tangle /etc/nixos/packages/crystalline/default.nix
  {
    lib,
    stdenv,
    fetchurl,
    gzip,
    ...
  }: stdenv.mkDerivation rec {
    pname = "crystalline";
    version = "0.10.0";
    src = fetchurl {
      url = "https://github.com/elbywan/${pname}/releases/download/v${version}/${pname}_x86_64-unknown-linux-musl.gz";
      sha256 = lib.fakeSha256;
    };

    buildInputs = [ gzip ];
    unpackCmd = "${gzip}/bin/gzip -d $curSrc"

    installPhase = ''
      chmod u+x crystalline
      mkdir -p $out/bin
      cp -a crystalline $out/bin
    '';

    meta = with lib; {
      description = "A Language Server Protocol implementation for Crystal. 🔮";
      homepage = "https://github.com/elbywan/crystalline";
      license = licenses.mit;
      platforms = platforms.linux;
      maintainers = with maintainers; [ t3mpt0n ];
    };
  }
#+end_src

Then, append this to wherever you call your packages [NOTE: this block is not tangled]:
#+begin_src nix
  {
    pkgs,
    ...
  }: with pkgs; rec {
    crystalline = callPackage ./wherever_crystalline_deriv_is {};
  }
#+end_src

***** Installing the packages
#+begin_src nix :mkdirp yes :tangle ./lsp/crystal.nix
  {
    self,
    pkgs,
    lib,
    ...
  }: {
    environment.systemPackages = with pkgs; [
      self.outputs.packages.x86_64-linux.crystalline
      crystal
    ];
  }
#+end_src

**** Configuration
Now that we have installed both packages let's configure them with eglot:
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package crystal-mode
    :after eglot
    :hook (crystal-mode . eglot-ensure)
    :config (push '(crystal-mode . ("crystalline") eglot-server-programs)))

  (use-package flycheck-crystal :after crystal-mode)
  (use-package inf-crystal :after crystal-mode)

  (use-package ameba
    :after crystal-mode
    :init (flycheck-ameba-setup))
  (use-package flycheck-ameba :after ameba)
#+end_src

*** Org-Src Mode Compatibility
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
  (use-package org-src
    :hook (org-src-mode . eglot-ensure))
#+end_src

* Dired
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
  (use-package dired
    :config
    (setq dired-listing-switches "-agho --group-directories-first"
          dired-recursive-copies 'top
          dired-recursive-deletes 'top
          dired-dwim-target t
          dired-auto-revert-buffer t)
    (t3mpt0n/leader-keys
      "d" '(:which-key "Dired")
      "d d" '(dired :which-key "Open Dired")
      "d j" '(dired-jump :which "Jump to Current Buffer Dir"))
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file)
    (evil-define-key 'normal dired-mode-map (kbd "RET") 'dired-open-file)

    :custom
    (if (< emacs-major-version 28)
        (progn
          (require 'dired-x)
          (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
          (define-key dired-mode-map (kbd "^") (lambda () (interactive) (find-alternate-file ".."))))
      (progn
        (setq dired-kill-when-opening-new-dired-buffer t))))
#+end_src

** Icons for Dired
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
  (use-package nerd-icons-dired
    :after (dired nerd-icons)
    :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

** Peep Dired
Peep a file in Dired.
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
  (use-package peep-dired
    :hook (peep-dired . evil-normalize-keymaps)
    :config
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
    (t3mpt0n/leader-keys
      "d p" '(peep-dired :which "Peep Dired")))
#+end_src

** File Compression Programs
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
  (eval-after-load "dired-aux"
    '(progn
       (add-to-list 'dired-compress-file-suffixes '("\\.zip\\'" ".zip" "unzip %i"))
       (add-to-list 'dired-compress-file-suffixes '("\\.rar\\'" ".rar" "unrar x %i"))))
#+end_src

** Open File Extensions
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
  (use-package dired-open
    :config
    (setq dired-open-extensions '(("gif" . "imv")
                                  ("jpg" . "imv")
                                  ("jpeg" . "imv")
                                  ("png" . "imv")
                                  ("mkv" . "mpv")
                                  ("mp4" . "mpv")
                                  ("mp3" . "mpv")
                                  ("m4a" . "mpv")
                                  ("ogg" . "mpv")
                                  ("opus" . "mpv")
                                  ("nes" . "nestopia -f")
                                  ("smc" . "ares --system Super Famicom --fullscreen")
                                  ("sfc" . "ares --system Super Famicom --fullscreen")
                                  ("n64" . "flatpak run --filesystem=host:ro io.github.simple64.simple64 --nogui")
                                  ("v64" . "flatpak run --filesystem=host:ro io.github.simple64.simple64 --nogui")
                                  ("z64" . "flatpak run --filesystem=host:ro io.github.simple64.simple64 --nogui")
                                  ("torrent" . "qbittorrent"))))
#+end_src

* Other Useful Programs
** VTerm
#+begin_src elisp :mkdirp yes :tangle ./modules/other.el
  (use-package vterm
    :config
    (setq shell-file-name "/run/current-system/sw/bin/fish"
          vterm-max-scrollback 5000))

  (use-package multi-vterm :after vterm)
#+end_src

** RecentF
#+begin_src elisp :mkdirp yes :tangle ./modules/other.el
  (use-package recentf
    :init
    (recentf-mode)

    :config
    (t3mpt0n/leader-keys
      "f r" '(counsel-recentf :which "Recent Files")))
#+end_src

