emacs/modules/other.el
(use-package vterm
  :config
  (setq shell-file-name "/run/current-system/sw/bin/fish"
        vterm-max-scrollback 5000))

(use-package multi-vterm :after vterm)

(use-package recentf
  :init
  (recentf-mode)

  :config
  (t3mpt0n/leader-keys
    "f r" '(counsel-recentf :which "Recent Files")))
