emacs/README.org
** Projectile
#+begin_src elisp :mkdirp yes :tangle ./modules/other.el
  (use-package projectile
    :init
    (projectile-mode +1)

    :bind (:map projectile-mode-map
      ("C-c p" . projectile-command-map))

    :config
    (setq projectile-sort-order 'recentf
          projectile-enable-caching t
          projectile-file-exists-remote-cache-expire (* 10 60)
          projectile-completion-system 'ivy
          projectile-switch-project-action #'projectile-dired))
#+end_src
